### Pandas Join:

    Pandas join is a convenient method for joining columns of two potentionally different-indexed.

In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({"ID":[1,2,3],"Class":[9,10,11]})
df2=pd.DataFrame({"Rollno":[33,44,55],"Section":['A','B','C']})
display(df1,df2)

   ID  Class
0   1      9
1   2     10
2   3     11

   Rollno Section
0      33       A
1      44       B
2      55       C

"""
df1.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)
"""

In [3]:
df1.join(df2)

   ID  Class  Rollno Section
0   1      9      33       A
1   2     10      44       B
2   3     11      55       C

In [4]:
df3=pd.DataFrame({"Name":["alley","harry"]})
df3

    Name
0  alley
1  harry

In [5]:
df1.join(df3)

   ID  Class   Name
0   1      9  alley
1   2     10  harry
2   3     11    NaN

In [6]:
df3.join(df1)

    Name  ID  Class
0  alley   1      9
1  harry   2     10

### how parameter:

In [7]:
df1.join(df3,how="left")

   ID  Class   Name
0   1      9  alley
1   2     10  harry
2   3     11    NaN

In [8]:
df1.join(df3,how="right")

   ID  Class   Name
0   1      9  alley
1   2     10  harry

In [9]:
df1.join(df3,how="outer")

   ID  Class   Name
0   1      9  alley
1   2     10  harry
2   3     11    NaN

In [10]:
df1.join(df3,how="inner")

   ID  Class   Name
0   1      9  alley
1   2     10  harry

### index parameter:

In [11]:
df4=pd.DataFrame({"ID":[1,2,3,4],"Rollno":[56,33,77,85]},index=['a','b','c','d'])
df4

   ID  Rollno
a   1      56
b   2      33
c   3      77
d   4      85

In [12]:
df5=pd.DataFrame({"E_CODE":[11,12,13,14],"Marks":[32,98,72,15]},index=['a','b','c','d'])
df5

   E_CODE  Marks
a      11     32
b      12     98
c      13     72
d      14     15

In [13]:
df4.join(df5)

   ID  Rollno  E_CODE  Marks
a   1      56      11     32
b   2      33      12     98
c   3      77      13     72
d   4      85      14     15

In [14]:
df6=pd.DataFrame({"E_CODE":[111,112,113,114],"Marks":[322,928,722,125]},index=['a','b','c','d'])
df6

   E_CODE  Marks
a     111    322
b     112    928
c     113    722
d     114    125

In [15]:
# to join dataframe if they have same columns
df5.join(df6,lsuffix="_Bank_team",rsuffix="_wallet_team")

   E_CODE_Bank_team  Marks_Bank_team  E_CODE_wallet_team  Marks_wallet_team
a                11               32                 111                322
b                12               98                 112                928
c                13               72                 113                722
d                14               15                 114                125

## Append()

Pandas append function is used to append rows of other dataframe to the end of given dataframe,returning a new dataframe object.

In [16]:
df1

   ID  Class
0   1      9
1   2     10
2   3     11

In [17]:
df2

   Rollno Section
0      33       A
1      44       B
2      55       C

In [18]:
df1.append(df2,sort=False)

    ID  Class  Rollno Section
0  1.0    9.0     NaN     NaN
1  2.0   10.0     NaN     NaN
2  3.0   11.0     NaN     NaN
0  NaN    NaN    33.0       A
1  NaN    NaN    44.0       B
2  NaN    NaN    55.0       C

In [19]:
df3

    Name
0  alley
1  harry

In [20]:
df4

   ID  Rollno
a   1      56
b   2      33
c   3      77
d   4      85

In [21]:
df5

   E_CODE  Marks
a      11     32
b      12     98
c      13     72
d      14     15

In [22]:
df6

   E_CODE  Marks
a     111    322
b     112    928
c     113    722
d     114    125

In [23]:
df7=pd.DataFrame({"ID":[11,52,53,34],"Rollno":[516,373,717,815]},index=['a','b','c','d'])
df7

   ID  Rollno
a  11     516
b  52     373
c  53     717
d  34     815

In [24]:
df4.append(df7)

   ID  Rollno
a   1      56
b   2      33
c   3      77
d   4      85
a  11     516
b  52     373
c  53     717
d  34     815

In [25]:
df4.append(df7,ignore_index=True)

   ID  Rollno
0   1      56
1   2      33
2   3      77
3   4      85
4  11     516
5  52     373
6  53     717
7  34     815